//动态规划 
#include<iostream>
#include<cstdio>
#include<cstring>
using namespace std;
//（1）只包含0， 1， 2， 3的数
//     2在第一位。 
//（2）0在1之前，2在3之前
//（3）最高为不为0 
//动态规划 
//0  2---->a[k][0] = 1
//1  2 0---->a[k][1] = a[k-1][0] + a[k-1][1]*2
//2  2 3---->a[k][2] = a[k-1][0] + a[k-1][2]
//3  2 3 0 ---->a[k][3] = a[k-1][1] + a[k-1][2] + a[k-1][3]*2
//4  2 0 1---->a[k][4] = a[k-1][1] + a[k-1][4]*2
//5  2 0 1 3---->a[k][5] = a[k-1][3] + a[k-1][4] + a[k-1][5]*2
int main()
{
	int n;
	long long a[1010][10]={'\0'};
	scanf("%d", &n);
	memset(a,0,sizeof(a));
	for(int i=0; i<=n; i++) a[i][0] = 0;
	for(int k=1; k<=n; k++)
	{
		a[k][0] = 1;
		a[k][1] = (a[k-1][0] + a[k-1][1]*2)%1000000007;
		a[k][2] = (a[k-1][0] + a[k-1][2])%1000000007;
		a[k][3] = (a[k-1][1] + a[k-1][2] + a[k-1][3]*2)%1000000007;
		a[k][4] = (a[k-1][1] + a[k-1][4]*2)%1000000007;
		a[k][5] = (a[k-1][3] + a[k-1][4] + a[k-1][5]*2)%1000000007;
	}
	printf("%I64d\n", a[n][5]);
	return 0;
}
